let g_library;

g_library = [];

function addBook(author, name, country, year)
{
	let book;

	book = {
		author: author,
		name: name,
		country: country,
		year: year,
		count: Math.floor(Math.random() * 100) + 1
	}
	g_library.push(book);
}

addBook("А.С. Пушкин", "Дубровский", "Россия", 1842);
addBook("А.С. Пушкин", "Капитанская дочка", "Россия", 1836);
addBook("А.С. Пушкин", "Евгений Онегин", "Россия", 1837);
addBook("М.А. Булгаков", "Собачье сердце", "Россия", 1925);
addBook("М.А. Булгаков", "Мастер и Маргарита", "Россия", 1940);
addBook("И.С. Тургенев", "Отцы и дети", "Россия", 1861);
addBook("Л.Н. Толстой", "Воскресение", "Россия", 1866);
addBook("Л.Н. Толстой", "Война и мир", "Россия", 1868);
addBook("Л.Н. Толстой", "Анна Каренина", "Россия", 1877);
addBook("Н.В. Гоголь", "Ревизор", "Россия", 1836);
addBook("Ф.М. Достоевский", "Преступление и наказание", "Россия", 1866);
addBook("А.С. Грибоедов", "Горе от ума", "Россия", 1828);
addBook("М.Ю. Лермонтов", "Герой нашего времени", "Россия", 1840);
addBook("Даниель Дефо", "Робинзон Крузо", "Англия", 1719);
addBook("А.П. Чехов", "Рассказы", "Россия", 1885);
addBook("Александр Дюма", "Три мушкетёра", "Франция", 1844);
